#!/usr/bin/env python3
"""
Проверка структуры webhook события для понимания правильного recipient_id.
"""

print("\n" + "="*80)
print("📋 СТРУКТУРА INSTAGRAM WEBHOOK СОБЫТИЯ")
print("="*80)

print("""
Типичная структура Instagram webhook события:

{
  "object": "instagram",
  "entry": [
    {
      "id": "<page-id>",
      "time": 1234567890,
      "messaging": [
        {
          "sender": {
            "id": "<sender-id>"  ← ЭТО recipient_id для отправки!
          },
          "recipient": {
            "id": "<recipient-id>"  ← Это наш Instagram Business Account ID
          },
          "timestamp": 1234567890,
          "message": {
            "mid": "<message-id>",
            "text": "Текст сообщения"
          }
        }
      ]
    }
  ]
}

ВАЖНО:
- sender.id - это ID пользователя, который написал агенту
- sender.id используется как recipient_id при отправке ответа
- recipient.id - это ID нашего Instagram Business Account

Проверьте в логах сервера:
1. Найдите строку "Sender ID (это recipient_id для отправки):"
2. Убедитесь, что это именно тот ID, который вы используете
3. Проверьте, что ID точно совпадает (без пробелов, лишних символов)

Также проверьте:
- Может быть в webhook приходит другой формат ID
- Может быть нужно использовать ID из другого поля
- Может быть ID нужно преобразовать в другой формат
""")

print("\n💡 РЕКОМЕНДАЦИИ:")
print("   1. Откройте логи сервера (где запущен uvicorn)")
print("   2. Найдите последнее webhook событие после отправки сообщения")
print("   3. Скопируйте ТОЧНЫЙ sender.id из логов")
print("   4. Убедитесь, что это именно '62670099264' или другой ID")
print("   5. Попробуйте отправить с этим точным ID")
print("\n   6. Также проверьте, может быть в webhook есть поле 'user' или 'from'")
print("      с другим ID, который нужно использовать")

